scalarTransport/closedBus-case/0.orig/T
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1906                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      T;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
dimensions      [0 0 0 1 0 0 0];

internalField   uniform 293;

boundaryField
{
    cabin
    {
        type            zeroGradient;
    }
    seats
    {
        type            zeroGradient;
    }
    exhaust
    {
        type            inletOutlet;
        inletValue      $internalField;
        value           $internalField;
    }
    rails
    {
        type            zeroGradient;
    }
    supplyVents
    {
        type            zeroGradient;
    }
    driver
    {
        type            zeroGradient;
    }
    standingFwd
    {
        type            zeroGradient;
    }
    standingRear
    {
        type            zeroGradient;
    }
    mouthDriver
    {
        type            zeroGradient;
    }
    mouthStandingRear
    {
        type            zeroGradient;
    }
    mouthStandingFwd
    {
        type            fixedValue;
        value           uniform 310;
    }
    "proc.*"
    {
        type            processor;
    }
}


// ************************************************************************* //
